AlmAck/nuttx/arch/arm/src/da1470x/da1470x_irq.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_irq.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <debug.h>
#include <stdint.h>

#include <arch/armv8-m/nvicpri.h>
#include <arch/irq.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include "arm_internal.h"
#include "chip.h"
#include "da1470x_irq.h"
#include "hardware/da1470x_dma.h"
#include "hardware/da1470x_vad.h"
#include "nvic.h"
#include "ram_vectors.h"
#include <syslog.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Get a 32-bit version of the default priority */

#define DEFPRIORITY32                                                          \
  (NVIC_SYSH_PRIORITY_DEFAULT << 24 | NVIC_SYSH_PRIORITY_DEFAULT << 16 |       \
   NVIC_SYSH_PRIORITY_DEFAULT << 8 | NVIC_SYSH_PRIORITY_DEFAULT)

/* Given the address of a NVIC ENABLE register, this is the offset to
 * the corresponding CLEAR ENABLE register.
 */

#define NVIC_ENA_OFFSET (0)
#define NVIC_CLRENA_OFFSET (NVIC_IRQ0_31_CLEAR - NVIC_IRQ0_31_ENABLE)

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_dumpnvic
 *
 * Description:
 *   Dump some interesting NVIC registers
 *
 ****************************************************************************/

#if defined(CONFIG_DEBUG_IRQ_INFO)
static void da1470x_dumpnvic(const char *msg, int irq) {
  irqstate_t flags;

  flags = enter_critical_section();

  irqinfo("NVIC (%s, irq=%d):\n", msg, irq);
  irqinfo("  INTCTRL: %08x VECTAB: %08x\n", getreg32(NVIC_INTCTRL),
          getreg32(NVIC_VECTAB));
  irqinfo("  SYSHCON: %08x\n", getreg32(NVIC_SYSHCON));

  irqinfo("  IRQ ENABLE: ");
  for (int i = 0; i < DA1470X_IRQ_NEXTINT; i += 32) {
    irqinfo("%08x ", getreg32(NVIC_IRQ_ENABLE(i)));
  }

  irqinfo("\n");

  irqinfo("  SYSH_PRIO:  %08x %08x %08x\n", getreg32(NVIC_SYSH4_7_PRIORITY),
          getreg32(NVIC_SYSH8_11_PRIORITY), getreg32(NVIC_SYSH12_15_PRIORITY));

  irqinfo("  IRQ PRIO:   ");
  for (int i = 0; i < (DA1470X_IRQ_NEXTINT + 3) / 4; i += 4) {
    irqinfo("%08" PRIx32 " %08" PRIx32 " %08" PRIx32 " %08" PRIx32 "\n",
            getreg32(NVIC_IRQ_PRIORITY(4 * i)),
            getreg32(NVIC_IRQ_PRIORITY(4 * (i + 1))),
            getreg32(NVIC_IRQ_PRIORITY(4 * (i + 2))),
            getreg32(NVIC_IRQ_PRIORITY(4 * (i + 3))));
    if (i + 4 < (DA1470X_IRQ_NEXTINT + 3) / 4) {
      irqinfo("              ");
    }
  }

  leave_critical_section(flags);
}
#else
#define da1470x_dumpnvic(msg, irq)
#endif

/****************************************************************************
 * Name: da1470x_nmi, da1470x_pendsv, da1470x_pendsv, da1470x_reserved
 *
 * Description:
 *   Handlers for various exceptions.  None are handled and all are fatal
 *   error conditions.  The only advantage these provided over the default
 *   unexpected interrupt handler is that they provide a diagnostic output.
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_FEATURES
static int da1470x_nmi(int irq, void *context, void *arg) {
  up_irq_save();
  _err("PANIC!!! NMI received\n");
  PANIC();
  return 0;
}

static int da1470x_pendsv(int irq, void *context, void *arg) {
  up_irq_save();
  _err("PANIC!!! PendSV received\n");
  PANIC();
  return 0;
}

static int da1470x_reserved(int irq, void *context, void *arg) {
  up_irq_save();
  _err("PANIC!!! Reserved interrupt\n");
  PANIC();
  return 0;
}
#endif

/****************************************************************************
 * Name: da1470x_prioritize_syscall
 *
 * Description:
 *   Set the priority of an exception.  This function may be needed
 *   internally even if support for prioritized interrupts is not enabled.
 *
 ****************************************************************************/

static inline void da1470x_prioritize_syscall(int priority) {
  uint32_t regval;

  /* SVCALL is system handler 11 */

  regval = getreg32(NVIC_SYSH8_11_PRIORITY);
  regval &= ~NVIC_SYSH_PRIORITY_PR11_MASK;
  regval |= (priority << NVIC_SYSH_PRIORITY_PR11_SHIFT);
  putreg32(regval, NVIC_SYSH8_11_PRIORITY);
}

/****************************************************************************
 * Name: da1470x_irqinfo
 *
 * Description:
 *   Given an IRQ number, provide the register and bit setting to enable or
 *   disable the irq.
 *
 ****************************************************************************/

static int da1470x_irqinfo(int irq, uintptr_t *regaddr, uint32_t *bit,
                           uintptr_t offset) {
  int n;

  DEBUGASSERT(irq >= DA1470X_IRQ_NMI && irq < NR_IRQS);

  /* Check for external interrupt */

  if (irq >= DA1470X_IRQ_EXTINT) {
    n = irq - DA1470X_IRQ_EXTINT;
    *regaddr = NVIC_IRQ_ENABLE(n) + offset;
    *bit = (uint32_t)1 << (n & 0x1f);
  }

  /* Handle processor exceptions.  Only a few can be disabled */

  else {
    *regaddr = NVIC_SYSHCON;
    if (irq == DA1470X_IRQ_MEMFAULT) {
      *bit = NVIC_SYSHCON_MEMFAULTENA;
    } else if (irq == DA1470X_IRQ_BUSFAULT) {
      *bit = NVIC_SYSHCON_BUSFAULTENA;
    } else if (irq == DA1470X_IRQ_USAGEFAULT) {
      *bit = NVIC_SYSHCON_USGFAULTENA;
    } else if (irq == DA1470X_IRQ_SYSTICK) {
      *regaddr = NVIC_SYSTICK_CTRL;
      *bit = NVIC_SYSTICK_CTRL_ENABLE;
    } else {
      return ERROR; /* Invalid or unsupported exception */
    }
  }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_irqinitialize
 *
 * Description:
 *   Complete initialization of the interrupt system and enable normal,
 *   interrupt processing.
 *
 ****************************************************************************/

void up_irqinitialize(void) {
  uint32_t regaddr;
#if defined(CONFIG_DEBUG_FEATURES) && !defined(CONFIG_ARMV8M_USEBASEPRI)
  uint32_t regval;
#endif
  int num_priority_registers;
  int i;

  /* Diagnostic logging for IRQ 45 (VAD / DMA5) */

  syslog(LOG_EMERG,
         "IRQ45 PRE-CLEAR: DMA5:%08lx VAD3:%08lx VAD4:%08lx NVIC_PEND:%08lx\n",
         getreg32(DA1470_DMA_DMA5_CTRL), getreg32(DA1470X_VAD_CTRL3),
         getreg32(DA1470X_VAD_CTRL4),
         getreg32(ARMV8M_NVIC_BASE + NVIC_IRQ_CLRPEND_OFFSET(45)));

  /* Disable all interrupts */

  for (i = 0; i < DA1470X_IRQ_NEXTINT; i += 32) {
    putreg32(0xffffffff, NVIC_IRQ_CLEAR(i));
    putreg32(0xffffffff, NVIC_IRQ_CLRPEND(i));
  }

  syslog(LOG_EMERG, "IRQ45 POST-CLEAR: NVIC_PEND:%08lx\n",
         getreg32(ARMV8M_NVIC_BASE + NVIC_IRQ_CLRPEND_OFFSET(45)));

  /* Make sure that we are using the correct vector table.  The default
   * vector address is 0x0000:0000 but if we are executing code that is
   * positioned in SRAM or in external FLASH, then we may need to reset
   * the interrupt vector so that it refers to the table in SRAM or in
   * external FLASH.
   */

  uint32_t vectab = (uint32_t)_vectors;
  if ((vectab & 0xff000000) == 0x0f000000) {
    vectab += 0x11000000; /* Translate to data bus alias 0x20000000 */
  }

  putreg32(vectab, NVIC_VECTAB);

  __asm__ __volatile__("dsb" : : : "memory");
  __asm__ __volatile__("isb" : : : "memory");

#ifdef CONFIG_ARCH_RAMVECTORS
  /* If CONFIG_ARCH_RAMVECTORS is defined, then we are using a RAM-based
   * vector table that requires special initialization.
   */

  arm_ramvec_initialize();
#endif

  /* Set all interrupts (and exceptions) to the default priority */

  putreg32(DEFPRIORITY32, NVIC_SYSH4_7_PRIORITY);
  putreg32(DEFPRIORITY32, NVIC_SYSH8_11_PRIORITY);
  putreg32(DEFPRIORITY32, NVIC_SYSH12_15_PRIORITY);

  /* The NVIC ICTR register (bits 0-4) holds the number of interrupt
   * lines that the NVIC supports:
   *
   *  0 -> 32 interrupt lines,  8 priority registers
   *  1 -> 64 "       " "   ", 16 priority registers
   *  2 -> 96 "       " "   ", 32 priority registers
   *  ...
   */

  num_priority_registers = (getreg32(NVIC_ICTR) + 1) * 8;

  /* Now set all of the interrupt lines to the default priority */

  regaddr = NVIC_IRQ0_3_PRIORITY;
  while (num_priority_registers--) {
    putreg32(DEFPRIORITY32, regaddr);
    regaddr += 4;
  }

  /* Attach the SVCall and Hard Fault exception handlers.  The SVCall
   * exception is used for performing context switches; The Hard Fault
   * must also be caught because a SVCall may show up as a Hard Fault
   * under certain conditions.
   */

  irq_attach(DA1470X_IRQ_SVCALL, arm_svcall, NULL);
  irq_attach(DA1470X_IRQ_HARDFAULT, arm_hardfault, NULL);

  /* Set the priority of the SVCall interrupt */

#ifdef CONFIG_ARCH_IRQPRIO
#if 0
  up_prioritize_irq(DA1470X_IRQ_PENDSV, NVIC_SYSH_PRIORITY_MIN);
#endif
#endif

  da1470x_prioritize_syscall(NVIC_SYSH_SVCALL_PRIORITY);

#ifdef CONFIG_ARM_MPU
  /* If the MPU is enabled, then attach and enable the Memory Management
   * Fault handler.
   */

  irq_attach(DA1470X_IRQ_MEMFAULT, arm_memfault, NULL);
  up_enable_irq(DA1470X_IRQ_MEMFAULT);
#endif

  /* Attach all other processor exceptions (except reset and sys tick) */

#ifdef CONFIG_DEBUG_FEATURES
  irq_attach(DA1470X_IRQ_NMI, da1470x_nmi, NULL);
#ifndef CONFIG_ARM_MPU
  irq_attach(DA1470X_IRQ_MEMFAULT, arm_memfault, NULL);
#endif
  irq_attach(DA1470X_IRQ_BUSFAULT, arm_busfault, NULL);
  irq_attach(DA1470X_IRQ_USAGEFAULT, arm_usagefault, NULL);
  irq_attach(DA1470X_IRQ_PENDSV, da1470x_pendsv, NULL);
  arm_enable_dbgmonitor();
  irq_attach(DA1470X_IRQ_DBGMONITOR, arm_dbgmonitor, NULL);
  irq_attach(DA1470X_IRQ_RESERVED, da1470x_reserved, NULL);
#endif

  da1470x_dumpnvic("initial", DA1470X_IRQ_NIRQS);

  // #if defined(CONFIG_DEBUG_FEATURES) && !defined(CONFIG_ARMV8M_USEBASEPRI)
  //   /* If a debugger is connected, try to prevent it from catching
  //   hardfaults.
  //    * If CONFIG_ARMV8M_USEBASEPRI, no hardfaults are expected in normal
  //    * operation.
  //    */
  //
  //   regval  = getreg32(NVIC_DEMCR);
  //   regval &= ~NVIC_DEMCR_VCHARDERR;
  //   putreg32(regval, NVIC_DEMCR);
  // #endif

#ifndef CONFIG_SUPPRESS_INTERRUPTS
  /* And finally, enable interrupts */

  up_irq_enable();
#endif
}

/****************************************************************************
 * Name: up_disable_irq
 *
 * Description:
 *   Disable the IRQ specified by 'irq'
 *
 ****************************************************************************/

void up_disable_irq(int irq) {
  uintptr_t regaddr;
  uint32_t regval;
  uint32_t bit;

  if (da1470x_irqinfo(irq, &regaddr, &bit, NVIC_CLRENA_OFFSET) == 0) {
    /* Modify the appropriate bit in the register to disable the interrupt.
     * For normal interrupts, we need to set the bit in the associated
     * Interrupt Clear Enable register.  For other exceptions, we need to
     * clear the bit in the System Handler Control and State Register.
     */

    if (irq >= DA1470X_IRQ_EXTINT) {
      putreg32(bit, regaddr);
    } else {
      regval = getreg32(regaddr);
      regval &= ~bit;
      putreg32(regval, regaddr);
    }
  }

  da1470x_dumpnvic("disable", irq);
}

/****************************************************************************
 * Name: up_enable_irq
 *
 * Description:
 *   Enable the IRQ specified by 'irq'
 *
 ****************************************************************************/

void up_enable_irq(int irq) {
  uintptr_t regaddr;
  uint32_t regval;
  uint32_t bit;

  if (da1470x_irqinfo(irq, &regaddr, &bit, NVIC_ENA_OFFSET) == 0) {
    /* Modify the appropriate bit in the register to enable the interrupt.
     * For normal interrupts, we need to set the bit in the associated
     * Interrupt Set Enable register.  For other exceptions, we need to
     * set the bit in the System Handler Control and State Register.
     */

    if (irq >= DA1470X_IRQ_EXTINT) {
      putreg32(bit, regaddr);
    } else {
      regval = getreg32(regaddr);
      regval |= bit;
      putreg32(regval, regaddr);
    }
  }

  da1470x_dumpnvic("enable", irq);
}

/****************************************************************************
 * Name: da1470x_clrpend
 *
 * Description:
 *   Clear a pending interrupt at the NVIC.
 *
 ****************************************************************************/

void da1470x_clrpend(int irq) {
  /* Check for external interrupt */

  if (irq >= DA1470X_IRQ_EXTINT) {
    int n = irq - DA1470X_IRQ_EXTINT;

    /* Set the appropriate bit in the corresponding Interrupt Clear-Pending
     * Register.
     */

    putreg32((uint32_t)1 << (n & 0x1f), NVIC_IRQ_CLRPEND(n));
  }
}
/****************************************************************************
 * Name: arm_ack_irq
 *
 * Description:
 *   Acknowledge the IRQ
 *
 ****************************************************************************/

void arm_ack_irq(int irq) { da1470x_clrpend(irq); }

/****************************************************************************
 * Name: up_prioritize_irq
 *
 * Description:
 *   Set the priority of an IRQ.
 *
 *   Since this API is not supported on all architectures, it should be
 *   avoided in common implementations where possible.
 *
 ****************************************************************************/

#ifdef CONFIG_ARCH_IRQPRIO
int up_prioritize_irq(int irq, int priority) {
  uint32_t regaddr;
  uint32_t regval;
  int shift;

  DEBUGASSERT(irq >= DA1470X_IRQ_MEMFAULT && irq < NR_IRQS &&
              (unsigned)priority <= NVIC_SYSH_PRIORITY_MIN);

  if (irq < DA1470X_IRQ_EXTINT) {
    /* NVIC_SYSH_PRIORITY() maps {0..15} to one of three priority
     * registers (0-3 are invalid)
     */

    regaddr = NVIC_SYSH_PRIORITY(irq);
    irq -= 4;
  } else {
    /* NVIC_IRQ_PRIORITY() maps {0..} to one of many priority registers */

    irq -= DA1470X_IRQ_EXTINT;
    regaddr = NVIC_IRQ_PRIORITY(irq);
  }

  regval = getreg32(regaddr);
  shift = ((irq & 3) << 3);
  regval &= ~(0xff << shift);
  regval |= (priority << shift);
  putreg32(regval, regaddr);

  da1470x_dumpnvic("prioritize", irq);
  return OK;
}
#endif
